a9650615/esp32-rlcd-standalone/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FREERTOS_HZ=1000
# The initial LVGL object tree is built synchronously from app_main so startup
# failures can stop before the carousel timer is armed. The ESP-IDF default
# 3584-byte main-task stack overflows while rendering the first full page.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_QRCODE=y
# Wi-Fi setup portal: open captive AP + a 2-field HTTP form, no long POST
# bodies expected, but LWIP's default socket count is tight once the DNS
# responder's UDP socket and the setup AP's client join the HTTP listener.
CONFIG_LWIP_MAX_SOCKETS=16

# Providers fetch over HTTPS. The bundled root store avoids pinning a cert per
# host, which would break every time an upstream rotates.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_TLS_INSECURE=n

# mbedTLS allocates from PSRAM instead of internal RAM.
#
# Four providers on independent timers will overlap sooner or later, and two
# concurrent TLS sessions with the full certificate bundle do not fit in the
# ~240 KiB of internal heap: the second one fails ssl_setup with
# MBEDTLS_ERR_SSL_ALLOC_FAILED (-0x7F00) and its page shows NO DATA until the
# retry, minutes later. Observed with weather landing between the two market
# fetches.
#
# This board has 8 MiB of PSRAM that nothing else is competing for, so the fix
# is to stop making TLS share the scarce pool rather than to serialise the
# providers and have them wait on each other. Handshake buffers are not
# DMA targets, so PSRAM's restrictions do not apply to them.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# A freshly written OTA image boots as PENDING_VERIFY and is rolled back by the
# bootloader unless the app confirms it. main's ota_guard_task confirms it only
# after watching the LVGL render loop actually advance.
#
# This must be in place BEFORE the first image is ever written to an OTA slot:
# turning it on afterwards leaves that first update with no way back. Note that
# adding it here does nothing to an already-generated sdkconfig - delete
# sdkconfig and rebuild, then confirm the value landed (see the
# sdkconfig.defaults trap in the board skill).
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Development on this board is now done without a USB cable: firmware arrives
# by push OTA and the only way to see what happened is this. It streams every
# log line - and, in a debug build, the screenshot frames - to a plaintext
# unauthenticated TCP port, so anyone on the LAN who connects can read them.
#
# The Kconfig default stays `n` deliberately; this line is the developer's
# build turning it on, not the component changing its mind. Turn it off for
# anything left running on a network you do not control:
#   idf.py menuconfig -> CONFIG_NET_LOG_ENABLE=n
#
# The rule that keeps this survivable predates it: the Wi-Fi password and the
# setup-page password are never logged. That was a "someone needs a USB cable"
# mistake before and is an "anyone on the LAN" one now.
# Two HTTP servers (the portal and the firmware-upload listener), net_log's
# listener and client, and a TLS client for the weather/market fetches. The
# default of 16 leaves no headroom for that, and the symptom of running out is
# a failure in whichever subsystem happens to ask next.
CONFIG_LWIP_MAX_SOCKETS=24

CONFIG_NET_LOG_ENABLE=y
# Pushes install without the button press. Same reasoning and the same risk
# profile as the log mirror above: this is the developer's build, on a desk.
# The Kconfig default stays n, and the code is compiled out under NDEBUG
# regardless, so a release build cannot carry it. Turn it off for anything
# left on a network you do not control:
#   idf.py menuconfig -> CONFIG_OTA_ALLOW_UNCONFIRMED_PUSH=n
CONFIG_OTA_ALLOW_UNCONFIRMED_PUSH=y
# 32 KiB holds barely one 400x300 frame (~23 KiB once base64'd and prefixed),
# so a second page would evict the first before anyone connected. PSRAM, and
# there are 8 MB of it.
# 16 KiB, not 128. The ring is replayed to whoever connects before live lines
# start, and automatic light sleep (PM_ENABLE below) throttles TCP hard enough
# that replaying 128 KiB took tens of minutes: a 340-second capture reached the
# 58th second of the log and never caught up. On a board with no cable that is
# not a slow log, it is no log. 16 KiB still holds the whole boot sequence,
# which is what the ring exists for.
CONFIG_NET_LOG_RING_BYTES=16384

# Battery divider trim for this specific board, from its own readings rather
# than a multimeter: 44 samples across several hours on USB spanned 4071-4092
# mV, a 21 mV plateau, which is a cell that has finished charging. A CC/CV
# charger terminates a single Li-ion cell at 4200 mV to about a percent, so the
# divider reads roughly 3% low: 1000 * 4200 / 4076.
#
# Set per board. It matters most for the overvoltage warning - a reading 3% low
# turns a real 4300 mV into 4170 and the threshold never fires.
CONFIG_BATTERY_CALIBRATION_PERMILLE=1030

# AirPlay sends 125 audio packets a second, one every 8 ms. The default of 6
# is 48 ms of slack before lwIP starts dropping them, and this board stalls
# for longer than that - a display flush was measured starving the audio path
# for 60 ms. The packets arrived; nothing was there to take them. 64 packets
# is half a second, which is longer than any stall seen here, and costs one
# pointer each.
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64

# Standby power. Measured before this: -40 mV/h with the cable out, about
# -2.9 %/h against the discharge curve, so roughly 34 hours from full. The
# panel was not the cause - f98824f took idle down to a handful of flushes a
# minute - the CPU was: 160 MHz pinned with no DFS, a 1000 Hz tick that was
# never skipped, and a 5 ms LVGL tick timer, which together left the longest
# idle window on the board at one millisecond.
#
# The frequency range and whether sleep is allowed are set by
# esp_pm_configure() in app_main.cpp rather than by PM_DFS_INIT_AUTO, because
# the numbers and the reasoning belong in the same place. APB stays at 80 MHz
# on the S3 regardless of CPU frequency, so SPI and I2C timing do not move.
#
# Tickless idle is what makes DFS worth anything: without it the 1 ms tick
# wakes the CPU 1000 times a second whether or not there is work, and the
# frequency it wakes at is the only thing DFS could have changed.
#
# If CONFIG_AIRPLAY_ENABLE is ever switched on, re-check this: a frequency
# transition costs tens of microseconds, and the I2S path is the one thing
# here that would hear it. The driver takes an APB lock, so the expectation is
# that it is fine - but that is an expectation, not a measurement.
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# --- internal RAM budget, so an optional AirPlay receiver can actually start
#
# raop_create() needs 13,468 bytes of *contiguous internal* RAM, and on this
# board that is close to all of what is left once PM_ENABLE (above) has taken
# its ~9.9 KB. Without the two settings below the receiver came up on some
# boots and not others - same firmware, different heap layout - which is worse
# than failing, because it looks fixed.
#
# The mDNS task's stack was the specific culprit: it is created immediately
# before raop_create() and, from internal RAM, split the one block raop needed.
# Its own component offers SPIRAM instead, and the prerequisites
# (FREERTOS_TASK_CREATE_ALLOW_EXT_MEM, SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY) were
# already on.
CONFIG_MDNS_TASK_CREATE_FROM_SPIRAM=y

# Wi-Fi buffers are heap-allocated at esp_wifi_init(), so `idf.py size` shows
# no change from this and only the board does: measured, internal RAM free
# after startup went 42,759 -> 49,435 with the largest block unchanged at
# 31,744, and AirPlay then started on three consecutive boots instead of
# roughly every other one.
#
# The cost is Wi-Fi throughput under sustained load, which this board has
# little of - its network work is a handful of TLS fetches an hour, a portal
# request, and an OTA push. Raise them back if a push starts taking
# noticeably longer, and expect that to trade against AirPlay starting.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
